In [3]:
import numpy as np
import pandas as pd

In [4]:
movies = pd.read_csv("C:\\Users\\HP\\Desktop\\python\\bollywood.csv")
subs = pd.read_csv("C:\\Users\\HP\\Desktop\\python\\subs.csv")
subs
vk = pd.read_csv("C:\\Users\\HP\\Desktop\\python\\kohli_ipl.csv")
vk

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [59]:
vk.set_index('match_no', inplace=True)

In [6]:
#astype -> to change the data type
# firsty to get the total size of seires
import sys 
sys.getsizeof(vk)

3584

In [7]:
vk.head(1)

sys.getsizeof(vk.astype('int16'))

1004

In [10]:
#between ->it will return as boolean series which tell that in the given range the values exit or not
vk[vk.between(51,99)].size

AttributeError: 'DataFrame' object has no attribute 'between'

In [12]:
#clip-> change in df such that all the value will clip in the given range 
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [16]:
subs.clip(100,200).tail(10)

     Subscribers gained
355                 149
356                 156
357                 177
358                 200
359                 200
360                 200
361                 200
362                 155
363                 144
364                 172

In [18]:
#drop_duplicate -> to remove the duplicate value

subs.drop_duplicates()

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
357                 177
359                 209
360                 231
361                 226
363                 144

[180 rows x 1 columns]

In [23]:
temp = pd.Series([1,1,2,2,3,3,45,54,4,5,6,7,7,7,9,0,12,1,12,21,2,45,54])
temp.size

23

In [25]:
temp = pd.Series([1,1,2,2,3,3,45,54,4,5,6,7,7,7,9,0,12,1,12,21,2,45,54])
temp.drop_duplicates(keep='last')

5      3
8      4
9      5
10     6
13     7
14     9
15     0
17     1
18    12
19    21
20     2
21    45
22    54
dtype: int64

In [37]:
#to chek that the given series have dupicate value if have find out how many
temp.duplicated()

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13     True
14    False
15    False
16    False
17     True
18     True
19    False
20     True
21     True
22     True
dtype: bool

In [29]:
temp.duplicated().sum()

10

In [45]:
# movies.set_index('movie')
movies

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [46]:
movies.duplicated

<bound method DataFrame.duplicated of                                                   lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]>

In [60]:
vk.duplicated().sum()

137

In [71]:
#operation on null value
temp = pd.Series([1,np.nan,3,4,5,np.nan,7,np.nan,9,10 ])
temp.isnull()

2

In [79]:
#size - it calucte the total size of seris irespective of null value
temp.size

10

In [73]:
#count -> it calulate the total size of series but remove all the null value
temp.count()

7

In [78]:
temp.isnull().sum()

3

In [80]:
# to remove all the missing values
temp.dropna()

0     1.0
2     3.0
3     4.0
4     5.0
6     7.0
8     9.0
9    10.0
dtype: float64

In [81]:
# to change the value of missing value 
temp.fillna(0)
# here every missing value will be replace by 0

0     1.0
1     0.0
2     3.0
3     4.0
4     5.0
5     0.0
6     7.0
7     0.0
8     9.0
9    10.0
dtype: float64